# SetSurfaceNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefaultDivideSettings..::..SetSurfaceNumber Method
DefaultDivideSettings Class See Also
---
Sets the default Divided Surface number for a fixed number layout for U or V gridlines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetSurfaceNumber(
	UVGridlineType gridlines,
	int number
)
```

Visual Basic
---
```text
Public Sub SetSurfaceNumber ( _
	gridlines As UVGridlineType, _
	number As Integer _
)
```

Visual C++
---
```text
public:
void SetSurfaceNumber(
	UVGridlineType gridlines,
	int number
)
```

# ### Parameters
gridlines
    Type: Autodesk.Revit.DB..::..UVGridlineType U-gridlines or V-gridlines.
number
    Type: System..::..Int32 A default number for a fixed number layout.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for number is not positive. -or- A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace